-- MariaDB dump 10.19  Distrib 10.4.24-MariaDB, for Win64 (AMD64)
--
-- Host: localhost    Database: estock
-- ------------------------------------------------------
-- Server version	10.4.24-MariaDB

/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;
/*!40103 SET @OLD_TIME_ZONE=@@TIME_ZONE */;
/*!40103 SET TIME_ZONE='+00:00' */;
/*!40014 SET @OLD_UNIQUE_CHECKS=@@UNIQUE_CHECKS, UNIQUE_CHECKS=0 */;
/*!40014 SET @OLD_FOREIGN_KEY_CHECKS=@@FOREIGN_KEY_CHECKS, FOREIGN_KEY_CHECKS=0 */;
/*!40101 SET @OLD_SQL_MODE=@@SQL_MODE, SQL_MODE='NO_AUTO_VALUE_ON_ZERO' */;
/*!40111 SET @OLD_SQL_NOTES=@@SQL_NOTES, SQL_NOTES=0 */;

--
-- Table structure for table `catalogs`
--

DROP TABLE IF EXISTS `catalogs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `catalogs` (
  `cat_id` int(13) NOT NULL AUTO_INCREMENT,
  `cat_name` varchar(250) NOT NULL,
  `cat_detail` varchar(250) DEFAULT NULL,
  `cat_sort` int(13) DEFAULT NULL,
  PRIMARY KEY (`cat_id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `catalogs`
--

LOCK TABLES `catalogs` WRITE;
/*!40000 ALTER TABLE `catalogs` DISABLE KEYS */;
INSERT INTO `catalogs` VALUES (1,'วัสดุสำนักงาน',NULL,1),(2,'วัสดุคอมพิวเตอร์',NULL,2),(3,'วัสดุไฟฟ้า',NULL,3),(4,'วัสดุงานบ้านงานครัว',NULL,4);
/*!40000 ALTER TABLE `catalogs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ord_lists`
--

DROP TABLE IF EXISTS `ord_lists`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ord_lists` (
  `ord_list_id` int(13) NOT NULL AUTO_INCREMENT,
  `ord_id` int(13) NOT NULL,
  `pro_id` int(13) NOT NULL,
  `pro_name` varchar(250) DEFAULT NULL,
  `unit_name` varchar(250) NOT NULL,
  `qua` int(10) DEFAULT 0,
  `qua_pay` int(10) DEFAULT 0,
  `ord_own` varchar(250) NOT NULL,
  `ord_app` varchar(250) NOT NULL,
  `st` int(10) DEFAULT 0,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`ord_list_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ord_lists`
--

LOCK TABLES `ord_lists` WRITE;
/*!40000 ALTER TABLE `ord_lists` DISABLE KEYS */;
/*!40000 ALTER TABLE `ord_lists` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `ords`
--

DROP TABLE IF EXISTS `ords`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `ords` (
  `ord_id` int(13) NOT NULL AUTO_INCREMENT,
  `ord_own` varchar(250) DEFAULT NULL,
  `ord_date` date DEFAULT current_timestamp(),
  `ord_app` varchar(250) DEFAULT NULL,
  `ord_pay_date` datetime DEFAULT NULL,
  `ord_pay_own` varchar(250) DEFAULT NULL,
  `comment` varchar(250) DEFAULT NULL,
  `st` int(10) DEFAULT 0,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`ord_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `ords`
--

LOCK TABLES `ords` WRITE;
/*!40000 ALTER TABLE `ords` DISABLE KEYS */;
/*!40000 ALTER TABLE `ords` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `products`
--

DROP TABLE IF EXISTS `products`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `products` (
  `pro_id` int(13) NOT NULL AUTO_INCREMENT,
  `pro_name` varchar(250) NOT NULL,
  `pro_detail` text DEFAULT NULL,
  `cat_name` varchar(250) NOT NULL,
  `unit_name` varchar(250) NOT NULL,
  `instock` int(10) DEFAULT 0,
  `locat` varchar(250) DEFAULT '1',
  `lower` int(10) DEFAULT 1,
  `min` int(10) DEFAULT 1,
  `st` int(10) DEFAULT 0,
  `img` varchar(250) DEFAULT NULL,
  `own` varchar(250) DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`pro_id`)
) ENGINE=InnoDB AUTO_INCREMENT=109 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `products`
--

LOCK TABLES `products` WRITE;
/*!40000 ALTER TABLE `products` DISABLE KEYS */;
INSERT INTO `products` VALUES (1,'กระดาษ A4',NULL,'วัสดุสำนักงาน','รีม',0,'1',1,5,1,NULL,NULL,'2022-05-17 13:44:56','2022-05-17 13:46:20'),(2,'กระดาษ A4 สีฟ้า',NULL,'วัสดุสำนักงาน','รีม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(3,'กระดาษ A4 สีเขียว',NULL,'วัสดุสำนักงาน','รีม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(4,'กระดาษ A4 สีเหลือง',NULL,'วัสดุสำนักงาน','รีม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(5,'กระดาษ A4 สีเหลือง',NULL,'วัสดุสำนักงาน','รีม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(6,'กรรไกร 9นิ้ว',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(7,'กาวยู้ฮู',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(8,'คลิปดำ No.108',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(9,'คลิปดำ No.109',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(10,'คลิปดำ No.110',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(11,'คลิปดำ No.111',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(12,'เครื่องเจาะกระดาษ-เล็ก',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(13,'เครื่องเย็บกระดาษ No.10',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(14,'เครื่องเย็บกระดาษ No.88',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(15,'เครื่องเหลาดินสอ',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(16,'คัตเตอร์-ใหญ่',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(17,'คัตเตอร์-เล็ก',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(18,'เชือกมัดสำนวน',NULL,'วัสดุสำนักงาน','ม้วน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(19,'ซองครุฑสีน้ำตาลพับ3',NULL,'วัสดุสำนักงาน','ซอง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(20,'ซองครุฑสีน้ำตาลพับ2',NULL,'วัสดุสำนักงาน','ซอง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(21,'ซองครุฑสีน้ำตาลพับ2',NULL,'วัสดุสำนักงาน','ซอง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(22,'ซองครุฑสีน้ำตาล A4 ขยายข้าง',NULL,'วัสดุสำนักงาน','ซอง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(23,'ดินสอ HB',NULL,'วัสดุสำนักงาน','แท่ง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(24,'ดินสอ 2B',NULL,'วัสดุสำนักงาน','แท่ง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(25,'ตลับชาติ-สีดำ',NULL,'วัสดุสำนักงาน','ตลับ',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(26,'ตลับชาติ-สีแดง',NULL,'วัสดุสำนักงาน','ตลับ',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(27,'ที่ดึงลวดเย็บกระดาษ',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(28,'เทปกาวสีน้ำตาล',NULL,'วัสดุสำนักงาน','ม้วน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(29,'เทปกาวผ้า (แล็กซีน) ขนาด 2 นิ้ว',NULL,'วัสดุสำนักงาน','ม้วน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(30,'เทปกาวผ้า (แล็กซีน) ขนาด 1.5 นิ้ว',NULL,'วัสดุสำนักงาน','ม้วน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(31,'เทปกาวผ้า (แล็กซีน) ขนาด 2.5 นิ้ว',NULL,'วัสดุสำนักงาน','ม้วน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(32,'เทปกาวสองหน้า-ชนิดหนา',NULL,'วัสดุสำนักงาน','ม้วน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(33,'ปากกาดำ',NULL,'วัสดุสำนักงาน','ด้าม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(34,'ปากกาแดง',NULL,'วัสดุสำนักงาน','ด้าม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(35,'ปากกาน้ำเงิน',NULL,'วัสดุสำนักงาน','ด้าม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(36,'ปากกาเขียนไวท์บอร์ด-น้ำเงิน',NULL,'วัสดุสำนักงาน','ด้าม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(37,'ปากกาเคมี 2 หัว-สีดำ',NULL,'วัสดุสำนักงาน','ด้าม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(38,'ปากกาเคมี 2 หัว-สีแดง (15)',NULL,'วัสดุสำนักงาน','ด้าม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(39,'ปากกาเคมี 2 หัว-สีแดง (15)',NULL,'วัสดุสำนักงาน','ด้าม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(40,'เป๊กทองเหลือง 1 นิ้ว',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(41,'เป๊กทองเหลือง 1 นิ้ว',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(42,'เป๊กทองเหลือง 1.5 นิ้ว',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(43,'เป๊กทองเหลือง 2 นิ้ว',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(44,'เป๊กทองเหลือง 2 นิ้ว',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(45,'เป๊กทองเหลือง 3 นิ้ว',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(46,'เป๊กทองเหลือง 3 นิ้ว',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(47,'ผ้าหมึกพิมพ์ดีด',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(48,'แฟ้มแขวน',NULL,'วัสดุสำนักงาน','แฟ้ม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(49,'แฟ้มพลาสติกแบบห่วง',NULL,'วัสดุสำนักงาน','แฟ้ม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(50,'แฟ้มอ่อน (ขนาดF4)',NULL,'วัสดุสำนักงาน','แฟ้ม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(51,'แฟ้มอ่อน (ขนาดA4)',NULL,'วัสดุสำนักงาน','แฟ้ม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(52,'แฟ้มสันแคบหนา 2 นิ้ว',NULL,'วัสดุสำนักงาน','แฟ้ม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(53,'แฟ้มสันกว้างหนา 3 นิ้ว',NULL,'วัสดุสำนักงาน','แฟ้ม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(54,'แฟ้มเสนอเซ็น',NULL,'วัสดุสำนักงาน','แฟ้ม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(55,'ไม้บรรทัด',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(56,'ยางลบ',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(57,'ลวดเสียบกระดาษ',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(58,'ลวดเย็บกระดาษ No.10',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(59,'ลวดเย็บกระดาษ No.35',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(60,'ลวดเย็บกระดาษ No. M8',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(61,'ลวดเย็บกระดาษ T3-10MB',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(62,'ลวดเย็บกระดาษ T3-10MB',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(63,'สก็อตเทปใส',NULL,'วัสดุสำนักงาน','ม้วน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(64,'สมุดบันทึก 4/150 80p',NULL,'วัสดุสำนักงาน','เล่ม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(65,'สมุดบัญชีน้ำเงิน-ใหญ่',NULL,'วัสดุสำนักงาน','เล่ม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(66,'สมุดบัญชีน้ำเงิน-เล็ก',NULL,'วัสดุสำนักงาน','เล่ม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(67,'หมึกเติมแท่นประทับตรา-สีดำ',NULL,'วัสดุสำนักงาน','ขวด',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(68,'หมึกเติมแท่นประทับตรา-สีแดง',NULL,'วัสดุสำนักงาน','ขวด',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(69,'หมึกเติมเครื่องรันนิ่ง',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(70,'หมึกถ่ายเอกสารริโก้',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(71,'หมึกเครื่องอัดสำเนา ริโก้ DX3443',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(72,'หมึกถ่ายเอกสาร kyocera tr-6329',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(73,'หมึกเครื่องถ่ายเอกสาร Tyocera 2552ci (TK-8349K) สีดำ',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(74,'หมึกเครื่องถ่ายเอกสาร Tyocera 2552ci (TK-8349C) สี Cyan',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(75,'หมึกเครื่องถ่ายเอกสาร Tyocera 2552ci (TK-8349M) สี Magenta',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(76,'แฟ้มพลาสติกแบบห่วง เบอร์ 221A4 สีฟ้า',NULL,'วัสดุสำนักงาน','แฟ้ม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(77,'ธงชาติ 150x225',NULL,'วัสดุสำนักงาน','ผืน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(78,'สมุดลงเวลาราชการ',NULL,'วัสดุสำนักงาน','เล่ม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(79,'ตรายางวันที่เลขอารบิค',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(80,'ถ่าน 2A',NULL,'วัสดุสำนักงาน','ก้อน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(81,'ถ่าน 3A',NULL,'วัสดุสำนักงาน','ก้อน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(82,'กระดาษ A4 สีม่วง',NULL,'วัสดุสำนักงาน','รีม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(83,'กระดาษ F4',NULL,'วัสดุสำนักงาน','รีม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(84,'ซองสีน้ำตาล F4 ขยายข้าง',NULL,'วัสดุสำนักงาน','ซอง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(85,'แปรงลบกระดาน',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(86,'ลิ้นแฟ้ม',NULL,'วัสดุสำนักงาน','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(87,'เครื่องเจาะกระดาษ-กลาง',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(88,'หมึกเติมแท่นประทับตรา-สีน้ำเงิน',NULL,'วัสดุสำนักงาน','ขวด',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(89,'ธงชาติไทย ขนาด 120x180 ซม.',NULL,'วัสดุสำนักงาน','ผืน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(90,'สันรูดแบบสามเหลี่ยม 10มม',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(91,'ใบมีดคัตเตอร์ เล็ก',NULL,'วัสดุสำนักงาน','เล่ม',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(92,'เทปกาวผ้าย่น 1.5',NULL,'วัสดุสำนักงาน','ม้วน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(93,'ธงชาติ 60x90',NULL,'วัสดุสำนักงาน','ผืน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(94,'ปากกาเขียนครุภัณฑ์',NULL,'วัสดุสำนักงาน','แท่ง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(95,'แท่นตัดสก็อตเทปใส',NULL,'วัสดุสำนักงาน','อัน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(96,'ธงในหลวง ร.10',NULL,'วัสดุสำนักงาน','ผืน',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(97,'หมึกเลเซอร์ Brother 2280',NULL,'วัสดุคอมพิวเตอร์','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(98,'ผงหมึกเลเซอร์ brother 2025',NULL,'วัสดุคอมพิวเตอร์','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(99,'ผงหมึกเลเซอร์ brother 3250',NULL,'วัสดุคอมพิวเตอร์','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(100,'ผงหมึกเลเซอร์ brother 3250',NULL,'วัสดุคอมพิวเตอร์','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(101,'ผงหมึกเลเซอร์ XEROX 3435',NULL,'วัสดุคอมพิวเตอร์','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(102,'หมึกพิมพ์ samsung ML-2250',NULL,'วัสดุคอมพิวเตอร์','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(103,'ตลับหมึกพิมพ์ CANNON HP 12A (Q2612AC)',NULL,'วัสดุคอมพิวเตอร์','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(104,'หมึกพิมพ์ OKI 391',NULL,'วัสดุคอมพิวเตอร์','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(105,'ตลับหมึกพิมพ์ HP 80A (CF280XC)',NULL,'วัสดุคอมพิวเตอร์','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(106,'หมึกพิมพ์ HP 26A (CF226XC)',NULL,'วัสดุคอมพิวเตอร์','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(107,'หมึกพิมพ์ cannon 328',NULL,'วัสดุคอมพิวเตอร์','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52'),(108,'ตลับหมึก Brother HL 2320D (TN-2380)',NULL,'วัสดุคอมพิวเตอร์','กล่อง',0,'1',1,1,1,NULL,NULL,'2022-05-17 13:45:52','2022-05-17 13:45:52');
/*!40000 ALTER TABLE `products` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `rec_lists`
--

DROP TABLE IF EXISTS `rec_lists`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `rec_lists` (
  `rec_list_id` int(13) NOT NULL AUTO_INCREMENT,
  `rec_id` int(13) NOT NULL,
  `rec_date` date DEFAULT NULL,
  `pro_id` int(13) NOT NULL,
  `pro_name` varchar(250) DEFAULT NULL,
  `unit_name` varchar(250) NOT NULL,
  `qua` int(10) NOT NULL,
  `qua_for_ord` int(10) NOT NULL,
  `price_one` varchar(250) NOT NULL,
  `price` varchar(250) NOT NULL,
  `rec_own` varchar(250) NOT NULL,
  `rec_app` varchar(250) NOT NULL,
  `st` int(10) DEFAULT 0,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`rec_list_id`)
) ENGINE=InnoDB AUTO_INCREMENT=328 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `rec_lists`
--

LOCK TABLES `rec_lists` WRITE;
/*!40000 ALTER TABLE `rec_lists` DISABLE KEYS */;
INSERT INTO `rec_lists` VALUES (219,1,'0000-00-00',0,'กระดาษ A4 สีชมพู','รีม',4,4,'100','400','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(220,1,'0000-00-00',0,'กระดาษ A4 สีฟ้า','รีม',6,6,'95','570','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(221,1,'0000-00-00',0,'กระดาษ A4 สีเขียว','รีม',4,4,'100','400','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(222,1,'0000-00-00',0,'กระดาษ A4 สีเหลือง','รีม',6,6,'100','600','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(223,1,'0000-00-00',0,'กระดาษ A4 สีเหลือง','รีม',27,27,'95','2565','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(224,1,'0000-00-00',0,'กรรไกร 9 นิ้ว','อัน',1,1,'85','85','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(225,1,'0000-00-00',0,'กาวยู้ฮู','อัน',9,9,'115','1035','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(226,1,'0000-00-00',0,'คลิปดำ No.108','กล่อง',11,11,'84','924','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(227,1,'0000-00-00',0,'คลิปดำ No.109','กล่อง',14,14,'72','1008','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(228,1,'0000-00-00',0,'คลิปดำ No.110','กล่อง',3,3,'48','144','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(229,1,'0000-00-00',0,'คลิปดำ No.111','กล่อง',12,12,'36','432','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(230,1,'0000-00-00',0,'เครื่องเจาะกระดาษ-เล็ก','อัน',1,1,'75','75','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(231,1,'0000-00-00',0,'เครื่องเย็บกระดาษ No.10','อัน',1,1,'80','80','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(232,1,'0000-00-00',0,'เครื่องเย็บกระดาษ No.88','อัน',3,3,'345','1035','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(233,1,'0000-00-00',0,'เครื่องเหลาดินสอ','อัน',1,1,'380','380','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(234,1,'0000-00-00',0,'คัตเตอร์-ใหญ่','อัน',3,3,'50','150','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(235,1,'0000-00-00',0,'คัตเตอร์-เล็ก','อัน',4,4,'35','140','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(236,1,'0000-00-00',0,'เชือกมัดสำนวน','ม้วน',15,15,'25','375','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(237,1,'0000-00-00',0,'ซองครุฑสีน้ำตาลพับ3','ซอง',200,200,'3','600','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(238,1,'0000-00-00',0,'ซองครุฑสีน้ำตาลพับ2','ซอง',1350,1350,'1','1350','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(239,1,'0000-00-00',0,'ซองครุฑสีน้ำตาลพับ2','ซอง',500,500,'2','1000','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(240,1,'0000-00-00',0,'ซองครุฑสีน้ำตาล A4 ขยายข้าง','ซอง',24,24,'5','120','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(241,1,'0000-00-00',0,'ดินสอ HB','แท่ง',1,1,'4','4','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(242,1,'0000-00-00',0,'ดินสอ 2B','แท่ง',4,4,'20','80','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(243,1,'0000-00-00',0,'ตลับชาติ-สีดำ','ตลับ',2,2,'30','60','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(244,1,'0000-00-00',0,'ตลับชาติ-สีแดง','ตลับ',2,2,'35','70','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(245,1,'0000-00-00',0,'ที่ดึงลวดเย็บกระดาษ','อัน',6,6,'65','390','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(246,1,'0000-00-00',0,'เทปกาวสีน้ำตาล','ม้วน',2,2,'25','50','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(247,1,'0000-00-00',0,'เทปกาวผ้า (แล็กซีน) ขนาด 2 นิ้ว','ม้วน',5,5,'75','375','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(248,1,'0000-00-00',0,'เทปกาวผ้า (แล็กซีน) ขนาด 1.5 นิ้ว','ม้วน',3,3,'55','165','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(249,1,'0000-00-00',0,'เทปกาวผ้า (แล็กซีน) ขนาด 2.5 นิ้ว','ม้วน',2,2,'100','200','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(250,1,'0000-00-00',0,'เทปกาวสองหน้า-ชนิดหนา','ม้วน',1,1,'220','220','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(251,1,'0000-00-00',0,'ปากกาดำ','ด้าม',47,47,'5','235','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(252,1,'0000-00-00',0,'ปากกาแดง','ด้าม',33,33,'5','165','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(253,1,'0000-00-00',0,'ปากกาน้ำเงิน','ด้าม',10,10,'5','50','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(254,1,'0000-00-00',0,'ปากกาเขียนไวท์บอร์ด-น้ำเงิน','ด้าม',6,6,'20','120','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(255,1,'0000-00-00',0,'ปากกาเคมี 2 หัว-สีดำ','ด้าม',16,16,'15','240','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(256,1,'0000-00-00',0,'ปากกาเคมี 2 หัว-สีแดง (15)','ด้าม',1,1,'15','15','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(257,1,'0000-00-00',0,'ปากกาเคมี 2 หัว-สีแดง (15)','ด้าม',12,12,'16','192','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(258,1,'0000-00-00',0,'เป๊กทองเหลือง 1 นิ้ว','กล่อง',2,2,'45','90','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(259,1,'0000-00-00',0,'เป๊กทองเหลือง 1 นิ้ว','กล่อง',12,12,'48','576','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(260,1,'0000-00-00',0,'เป๊กทองเหลือง 1.5 นิ้ว','กล่อง',2,2,'70','140','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(261,1,'0000-00-00',0,'เป๊กทองเหลือง 2 นิ้ว','กล่อง',16,16,'75','1200','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(262,1,'0000-00-00',0,'เป๊กทองเหลือง 2 นิ้ว','กล่อง',12,12,'80','960','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(263,1,'0000-00-00',0,'เป๊กทองเหลือง 3 นิ้ว','กล่อง',12,12,'105','1260','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(264,1,'0000-00-00',0,'เป๊กทองเหลือง 3 นิ้ว','กล่อง',3,3,'95','285','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(265,1,'0000-00-00',0,'ผ้าหมึกพิมพ์ดีด','กล่อง',1,1,'75','75','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(266,1,'0000-00-00',0,'แฟ้มแขวน','แฟ้ม',41,41,'20','820','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(267,1,'0000-00-00',0,'แฟ้มพลาสติกแบบห่วง','แฟ้ม',3,3,'60','180','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(268,1,'0000-00-00',0,'แฟ้มอ่อน (ขนาดF4)','แฟ้ม',22,22,'10','220','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(269,1,'0000-00-00',0,'แฟ้มอ่อน (ขนาดA4)','แฟ้ม',10,10,'10','100','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(270,1,'0000-00-00',0,'แฟ้มสันแคบหนา 2 นิ้ว','แฟ้ม',7,7,'75','525','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(271,1,'0000-00-00',0,'แฟ้มสันกว้างหนา 3 นิ้ว','แฟ้ม',8,8,'75','600','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(272,1,'0000-00-00',0,'แฟ้มเสนอเซ็น','แฟ้ม',18,18,'150','2700','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(273,1,'0000-00-00',0,'ไม้บรรทัด','อัน',5,5,'5','25','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(274,1,'0000-00-00',0,'ยางลบ','อัน',44,44,'5','220','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(275,1,'0000-00-00',0,'ลวดเสียบกระดาษ','กล่อง',18,18,'10','180','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(276,1,'0000-00-00',0,'ลวดเย็บกระดาษ No.10','กล่อง',10,10,'10','100','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(277,1,'0000-00-00',0,'ลวดเย็บกระดาษ No.35','กล่อง',36,36,'7','252','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(278,1,'0000-00-00',0,'ลวดเย็บกระดาษ No. M8','กล่อง',11,11,'15','165','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(279,1,'0000-00-00',0,'ลวดเย็บกระดาษ T3-10MB','กล่อง',1,1,'35','35','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(280,1,'0000-00-00',0,'ลวดเย็บกระดาษ T3-10MB','กล่อง',12,12,'38','456','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(281,1,'0000-00-00',0,'สก็อตเทปใส','ม้วน',3,3,'35','105','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(282,1,'0000-00-00',0,'สมุดบันทึก 4/15080p','เล่ม',3,3,'220','660','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(283,1,'0000-00-00',0,'สมุดบัญชีน้ำเงิน-ใหญ่','เล่ม',8,8,'80','640','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(284,1,'0000-00-00',0,'สมุดบัญชีน้ำเงิน-เล็ก','เล่ม',5,5,'45','225','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(285,1,'0000-00-00',0,'หมึกเติมแท่นประทับตรา-สีดำ','ขวด',4,4,'10','40','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(286,1,'0000-00-00',0,'หมึกเติมแท่นประทับตรา-สีแดง','ขวด',4,4,'35','140','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(287,1,'0000-00-00',0,'หมึกเติมเครื่องรันนิ่ง','กล่อง',2,2,'95','190','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(288,1,'0000-00-00',0,'หมึกถ่ายเอกสารริโก้','กล่อง',3,3,'2500','7500','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(289,1,'0000-00-00',0,'หมึกเครื่องอัดสำเนา ริโก้ DX3443','กล่อง',5,5,'550','2750','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(290,1,'0000-00-00',0,'หมึกถ่ายเอกสาร kyocera tr-6329','กล่อง',1,1,'4500','4500','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(291,1,'0000-00-00',0,'หมึกเครื่องถ่ายเอกสาร Tyocera 2552ci (TK-8349K) สีดำ','กล่อง',2,2,'3210','6420','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(292,1,'0000-00-00',0,'หมึกเครื่องถ่ายเอกสาร Tyocera 2552ci (TK-8349C) สี Cyan','กล่อง',1,1,'5885','5885','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(293,1,'0000-00-00',0,'หมึกเครื่องถ่ายเอกสาร Tyocera 2552ci (TK-8349M) สี Magenta','กล่อง',1,1,'5885','5885','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(294,1,'0000-00-00',0,'แฟ้มพลาสติกแบบห่วง เบอร์ 221A4 สีฟ้า','แฟ้ม',12,12,'60','720','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(295,1,'0000-00-00',0,'ธงชาติ 150x225','ผืน',3,3,'250','750','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(296,1,'0000-00-00',0,'สมุดลงเวลาราชการ','เล่ม',1,1,'75','75','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(297,1,'0000-00-00',0,'ตรายางวันที่เลขอารบิค','อัน',3,3,'95','285','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(298,1,'0000-00-00',0,'ถ่าน 2A','ก้อน',6,6,'22.50','135','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(299,1,'0000-00-00',0,'ถ่าน 3A','ก้อน',40,40,'22.50','900','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(300,1,'0000-00-00',0,'กระดาษ A4 สีม่วง','รีม',3,3,'100','300','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(301,1,'0000-00-00',0,'กระดาษ F4','รีม',8,8,'160','1280','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(302,1,'0000-00-00',0,'ซองสีน้ำตาล F4 ขยายข้าง','ซอง',150,150,'7','1050','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(303,1,'0000-00-00',0,'แปรงลบกระดาน','อัน',2,2,'25','50','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(304,1,'0000-00-00',0,'ลิ้นแฟ้ม','กล่อง',2,2,'95','190','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(305,1,'0000-00-00',0,'เครื่องเจาะกระดาษ-กลาง','อัน',3,3,'175','525','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(306,1,'0000-00-00',0,'หมึกเติมแท่นประทับตรา-สีน้ำเงิน','ขวด',4,4,'15','60','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(307,1,'0000-00-00',0,'ธงชาติไทย ขนาด 120x180ซม.','ผืน',3,3,'180','540','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(308,1,'0000-00-00',0,'สันรูดแบบสามเหลี่ยม 10มม','อัน',12,12,'10','120','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(309,1,'0000-00-00',0,'ใบมีดคัตเตอร์ เล็ก','เล่ม',13,13,'2.50','32.50','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(310,1,'0000-00-00',0,'เทปกาวผ้าย่น 1.5','ม้วน',3,3,'45','135','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(311,1,'0000-00-00',0,'ธงชาติ 60x90','ผืน',20,20,'45','900','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(312,1,'0000-00-00',0,'ปากกาเขียนครุภัณฑ์','แท่ง',4,4,'65','260','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(313,1,'0000-00-00',0,'แท่นตัดสก็อตเทปใส','อัน',1,1,'95','95','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(314,1,'0000-00-00',0,'ธงในหลวง ร.10','ผืน',12,12,'60','720','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(315,1,'0000-00-00',0,'หมึกเลเซอร์ Brother 2280','กล่อง',1,1,'2247','2247','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(316,1,'0000-00-00',0,'หมึกเลเซอร์ Brother 2280','กล่อง',1,1,'2300','2300','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(317,1,'0000-00-00',0,'ผงหมึกเลเซอร์ brother 2025','กล่อง',2,2,'2050','4100','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(318,1,'0000-00-00',0,'ผงหมึกเลเซอร์ brother 3250','กล่อง',1,1,'2461','2461','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(319,1,'0000-00-00',0,'ผงหมึกเลเซอร์ brother 3250','กล่อง',1,1,'5800','5800','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(320,1,'0000-00-00',0,'ผงหมึกเลเซอร์ XEROX 3435','กล่อง',2,2,'4300','8600','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(321,1,'0000-00-00',0,'หมึกพิมพ์ samsung ML-2250','กล่อง',1,1,'4300','4300','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(322,1,'0000-00-00',0,'ตลับหมึกพิมพ์ CANNON HP 12A (Q2612AC)','กล่อง',2,2,'2461','4922','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(323,1,'0000-00-00',0,'หมึกพิมพ์ OKI 391','กล่อง',1,1,'350','350','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(324,1,'0000-00-00',0,'ตลับหมึกพิมพ์ HP 80A (CF280XC)','กล่อง',3,3,'3959','11877','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(325,1,'0000-00-00',0,'หมึกพิมพ์ HP 26A (CF226XC)','กล่อง',3,3,'4066','12198','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(326,1,'0000-00-00',0,'หมึกพิมพ์ cannon 328','กล่อง',1,1,'2550','2550','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22'),(327,1,'0000-00-00',0,'ตลับหมึก Brother HL 2320D (TN-2380)','กล่อง',1,1,'1926','1926','administartor','administartor',1,'2022-05-17 15:17:09','2022-05-17 15:17:22');
/*!40000 ALTER TABLE `rec_lists` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `recs`
--

DROP TABLE IF EXISTS `recs`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `recs` (
  `rec_id` int(13) NOT NULL AUTO_INCREMENT,
  `rec_own` varchar(250) DEFAULT NULL,
  `rec_app` varchar(250) DEFAULT NULL,
  `rec_date` date DEFAULT NULL,
  `str_id` int(13) NOT NULL,
  `price_total` varchar(250) DEFAULT NULL,
  `comment` varchar(250) DEFAULT NULL,
  `st` int(10) DEFAULT 0,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`rec_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `recs`
--

LOCK TABLES `recs` WRITE;
/*!40000 ALTER TABLE `recs` DISABLE KEYS */;
INSERT INTO `recs` VALUES (1,'administartor','administartor','2021-10-01',7,'134956.5','ยอดยกมา ',1,'2022-05-17 14:04:08','2022-05-17 15:17:22');
/*!40000 ALTER TABLE `recs` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `sta`
--

DROP TABLE IF EXISTS `sta`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `sta` (
  `st_id` int(13) NOT NULL AUTO_INCREMENT,
  `st_name` varchar(250) NOT NULL,
  PRIMARY KEY (`st_id`)
) ENGINE=InnoDB DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `sta`
--

LOCK TABLES `sta` WRITE;
/*!40000 ALTER TABLE `sta` DISABLE KEYS */;
/*!40000 ALTER TABLE `sta` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `stock`
--

DROP TABLE IF EXISTS `stock`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `stock` (
  `stck_id` int(13) NOT NULL AUTO_INCREMENT,
  `pro_id` int(13) NOT NULL,
  `unit_name` varchar(250) DEFAULT NULL,
  `price_one` varchar(100) DEFAULT NULL,
  `bf` int(10) NOT NULL,
  `stck_in` int(10) DEFAULT NULL,
  `stck_out` int(10) DEFAULT NULL,
  `bal` int(10) NOT NULL,
  `rec_ord_id` int(10) DEFAULT NULL,
  `rec_ord_list_id` int(10) DEFAULT NULL,
  `comment` varchar(250) DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`stck_id`)
) ENGINE=InnoDB AUTO_INCREMENT=110 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `stock`
--

LOCK TABLES `stock` WRITE;
/*!40000 ALTER TABLE `stock` DISABLE KEYS */;
INSERT INTO `stock` VALUES (1,0,'รีม','100',0,4,0,4,1,219,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(2,0,'รีม','95',4,6,0,10,1,220,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(3,0,'รีม','100',10,4,0,14,1,221,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(4,0,'รีม','100',14,6,0,20,1,222,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(5,0,'รีม','95',20,27,0,47,1,223,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(6,0,'อัน','85',47,1,0,48,1,224,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(7,0,'อัน','115',48,9,0,57,1,225,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(8,0,'กล่อง','84',57,11,0,68,1,226,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(9,0,'กล่อง','72',68,14,0,82,1,227,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(10,0,'กล่อง','48',82,3,0,85,1,228,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(11,0,'กล่อง','36',85,12,0,97,1,229,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(12,0,'อัน','75',97,1,0,98,1,230,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(13,0,'อัน','80',98,1,0,99,1,231,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(14,0,'อัน','345',99,3,0,102,1,232,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(15,0,'อัน','380',102,1,0,103,1,233,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(16,0,'อัน','50',103,3,0,106,1,234,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(17,0,'อัน','35',106,4,0,110,1,235,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(18,0,'ม้วน','25',110,15,0,125,1,236,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(19,0,'ซอง','3',125,200,0,325,1,237,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(20,0,'ซอง','1',325,1350,0,1675,1,238,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(21,0,'ซอง','2',1675,500,0,2175,1,239,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(22,0,'ซอง','5',2175,24,0,2199,1,240,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(23,0,'แท่ง','4',2199,1,0,2200,1,241,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(24,0,'แท่ง','20',2200,4,0,2204,1,242,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(25,0,'ตลับ','30',2204,2,0,2206,1,243,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(26,0,'ตลับ','35',2206,2,0,2208,1,244,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(27,0,'อัน','65',2208,6,0,2214,1,245,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(28,0,'ม้วน','25',2214,2,0,2216,1,246,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(29,0,'ม้วน','75',2216,5,0,2221,1,247,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(30,0,'ม้วน','55',2221,3,0,2224,1,248,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(31,0,'ม้วน','100',2224,2,0,2226,1,249,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(32,0,'ม้วน','220',2226,1,0,2227,1,250,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(33,0,'ด้าม','5',2227,47,0,2274,1,251,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(34,0,'ด้าม','5',2274,33,0,2307,1,252,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(35,0,'ด้าม','5',2307,10,0,2317,1,253,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(36,0,'ด้าม','20',2317,6,0,2323,1,254,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(37,0,'ด้าม','15',2323,16,0,2339,1,255,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(38,0,'ด้าม','15',2339,1,0,2340,1,256,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(39,0,'ด้าม','16',2340,12,0,2352,1,257,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(40,0,'กล่อง','45',2352,2,0,2354,1,258,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(41,0,'กล่อง','48',2354,12,0,2366,1,259,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(42,0,'กล่อง','70',2366,2,0,2368,1,260,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(43,0,'กล่อง','75',2368,16,0,2384,1,261,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(44,0,'กล่อง','80',2384,12,0,2396,1,262,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(45,0,'กล่อง','105',2396,12,0,2408,1,263,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(46,0,'กล่อง','95',2408,3,0,2411,1,264,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(47,0,'กล่อง','75',2411,1,0,2412,1,265,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(48,0,'แฟ้ม','20',2412,41,0,2453,1,266,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(49,0,'แฟ้ม','60',2453,3,0,2456,1,267,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(50,0,'แฟ้ม','10',2456,22,0,2478,1,268,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(51,0,'แฟ้ม','10',2478,10,0,2488,1,269,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(52,0,'แฟ้ม','75',2488,7,0,2495,1,270,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(53,0,'แฟ้ม','75',2495,8,0,2503,1,271,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(54,0,'แฟ้ม','150',2503,18,0,2521,1,272,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(55,0,'อัน','5',2521,5,0,2526,1,273,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(56,0,'อัน','5',2526,44,0,2570,1,274,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(57,0,'กล่อง','10',2570,18,0,2588,1,275,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(58,0,'กล่อง','10',2588,10,0,2598,1,276,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(59,0,'กล่อง','7',2598,36,0,2634,1,277,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(60,0,'กล่อง','15',2634,11,0,2645,1,278,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(61,0,'กล่อง','35',2645,1,0,2646,1,279,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(62,0,'กล่อง','38',2646,12,0,2658,1,280,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(63,0,'ม้วน','35',2658,3,0,2661,1,281,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(64,0,'เล่ม','220',2661,3,0,2664,1,282,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(65,0,'เล่ม','80',2664,8,0,2672,1,283,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(66,0,'เล่ม','45',2672,5,0,2677,1,284,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(67,0,'ขวด','10',2677,4,0,2681,1,285,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(68,0,'ขวด','35',2681,4,0,2685,1,286,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(69,0,'กล่อง','95',2685,2,0,2687,1,287,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(70,0,'กล่อง','2500',2687,3,0,2690,1,288,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(71,0,'กล่อง','550',2690,5,0,2695,1,289,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(72,0,'กล่อง','4500',2695,1,0,2696,1,290,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(73,0,'กล่อง','3210',2696,2,0,2698,1,291,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(74,0,'กล่อง','5885',2698,1,0,2699,1,292,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(75,0,'กล่อง','5885',2699,1,0,2700,1,293,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(76,0,'แฟ้ม','60',2700,12,0,2712,1,294,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(77,0,'ผืน','250',2712,3,0,2715,1,295,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(78,0,'เล่ม','75',2715,1,0,2716,1,296,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(79,0,'อัน','95',2716,3,0,2719,1,297,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(80,0,'ก้อน','22.50',2719,6,0,2725,1,298,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(81,0,'ก้อน','22.50',2725,40,0,2765,1,299,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(82,0,'รีม','100',2765,3,0,2768,1,300,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(83,0,'รีม','160',2768,8,0,2776,1,301,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(84,0,'ซอง','7',2776,150,0,2926,1,302,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(85,0,'อัน','25',2926,2,0,2928,1,303,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(86,0,'กล่อง','95',2928,2,0,2930,1,304,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(87,0,'อัน','175',2930,3,0,2933,1,305,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(88,0,'ขวด','15',2933,4,0,2937,1,306,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(89,0,'ผืน','180',2937,3,0,2940,1,307,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(90,0,'อัน','10',2940,12,0,2952,1,308,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(91,0,'เล่ม','2.50',2952,13,0,2965,1,309,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(92,0,'ม้วน','45',2965,3,0,2968,1,310,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(93,0,'ผืน','45',2968,20,0,2988,1,311,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(94,0,'แท่ง','65',2988,4,0,2992,1,312,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(95,0,'อัน','95',2992,1,0,2993,1,313,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(96,0,'ผืน','60',2993,12,0,3005,1,314,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(97,0,'กล่อง','2247',3005,1,0,3006,1,315,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(98,0,'กล่อง','2300',3006,1,0,3007,1,316,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(99,0,'กล่อง','2050',3007,2,0,3009,1,317,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(100,0,'กล่อง','2461',3009,1,0,3010,1,318,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(101,0,'กล่อง','5800',3010,1,0,3011,1,319,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(102,0,'กล่อง','4300',3011,2,0,3013,1,320,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(103,0,'กล่อง','4300',3013,1,0,3014,1,321,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(104,0,'กล่อง','2461',3014,2,0,3016,1,322,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(105,0,'กล่อง','350',3016,1,0,3017,1,323,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(106,0,'กล่อง','3959',3017,3,0,3020,1,324,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(107,0,'กล่อง','4066',3020,3,0,3023,1,325,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(108,0,'กล่อง','2550',3023,1,0,3024,1,326,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22'),(109,0,'กล่อง','1926',3024,1,0,3025,1,327,'ยอดยกมา ','2022-05-17 15:17:22','2022-05-17 15:17:22');
/*!40000 ALTER TABLE `stock` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `store`
--

DROP TABLE IF EXISTS `store`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `store` (
  `str_id` int(13) NOT NULL AUTO_INCREMENT,
  `str_name` varchar(250) NOT NULL,
  `str_detail` varchar(250) DEFAULT NULL,
  `str_phone` varchar(250) DEFAULT NULL,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`str_id`)
) ENGINE=InnoDB AUTO_INCREMENT=8 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `store`
--

LOCK TABLES `store` WRITE;
/*!40000 ALTER TABLE `store` DISABLE KEYS */;
INSERT INTO `store` VALUES (1,'อุ่นรุ่งกิจ ','67/1-4 ถ.พิทักษ์ชาติ ต.ประจวบคีรีขันธ์ อ.เมือง จ.ประจวบคีรีขันธ์','032-602150','2022-05-10 10:22:31','2022-05-10 13:25:36'),(2,'บริษัท อาร์.เอส.ที.ออโตเมชั่น จำกัด (สำนักงานใหญ่)','227/16 ม.4 ถ.ชนเกษม ต.มะขามเตี้ย อ.เมือง จ.สุราษฎร์ธานี','077-218-6934','2022-05-10 10:22:31','2022-05-10 13:30:21'),(3,'บริษัท มิสเตอร์ อิ๊งค์ คอมพิวเตอร์ เซอร์วิส จำกัด (สำนักงานใหญ่)','6 ซ.วัดสุขใจ 5 แขวงทรายกองดิน เขตคลองสามวา กรุงเทพมหานคร','02-914-5200/ 02-914-5300/ 02-543-6926-30/ 086-345-5960-1','2022-05-10 10:22:31','2022-05-10 13:35:58'),(4,'พีเค ซัพพลาย','55/276 ม.6 ซ.เจริญใจ ถ.เทพารักษ์ ต.บางเมือง อ.เมือง จ.สมุทรปราการ','091-043-6653/ 062-069-9664/ 095-016-7019','2022-05-10 10:22:31','2022-05-10 13:29:37'),(5,'ร้าน ทีพีพี พริ้นติ้ง','264/95 ม.4 ถ.อำเภอ ต.มะขามเตี้ย อ.เมือง จ.สุราษฎร์ธานี','077-310137','2022-05-10 13:32:34','2022-05-10 13:32:34'),(6,'ร้านทิพย์รัตน์','51/2 ถ.ประจวบ อ.เมือง จ.ประจวบคีรีขันธ์','-','2022-05-10 13:34:06','2022-05-10 13:34:06'),(7,'ยอดยกมา','-','-','2022-05-17 15:14:55','2022-05-17 15:14:55');
/*!40000 ALTER TABLE `store` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `units`
--

DROP TABLE IF EXISTS `units`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `units` (
  `unit_id` int(13) NOT NULL AUTO_INCREMENT,
  `unit_name` varchar(250) NOT NULL,
  PRIMARY KEY (`unit_id`)
) ENGINE=InnoDB AUTO_INCREMENT=16 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `units`
--

LOCK TABLES `units` WRITE;
/*!40000 ALTER TABLE `units` DISABLE KEYS */;
INSERT INTO `units` VALUES (1,'รีม'),(2,'ใบ'),(3,'กล่อง'),(4,'อัน'),(5,'ม้วน'),(6,'ซอง'),(7,'แท่ง'),(8,'ตลับ'),(9,'ด้าม'),(10,'คู่'),(11,'เล่ม'),(12,'ขวด'),(13,'ก้อน'),(14,'ไม้'),(15,'แผ่น');
/*!40000 ALTER TABLE `units` ENABLE KEYS */;
UNLOCK TABLES;

--
-- Table structure for table `users`
--

DROP TABLE IF EXISTS `users`;
/*!40101 SET @saved_cs_client     = @@character_set_client */;
/*!40101 SET character_set_client = utf8 */;
CREATE TABLE `users` (
  `user_id` int(13) NOT NULL AUTO_INCREMENT,
  `username` varchar(250) NOT NULL,
  `password` varchar(250) NOT NULL,
  `token` varchar(250) DEFAULT NULL,
  `email` varchar(250) NOT NULL,
  `role` varchar(100) NOT NULL,
  `fullname` varchar(250) NOT NULL,
  `dep` varchar(250) DEFAULT NULL,
  `phone` varchar(100) DEFAULT NULL,
  `st` int(13) DEFAULT 0,
  `created_at` datetime DEFAULT current_timestamp(),
  `updated_at` datetime DEFAULT current_timestamp() ON UPDATE current_timestamp(),
  PRIMARY KEY (`user_id`),
  UNIQUE KEY `user_id` (`user_id`)
) ENGINE=InnoDB AUTO_INCREMENT=2 DEFAULT CHARSET=utf8;
/*!40101 SET character_set_client = @saved_cs_client */;

--
-- Dumping data for table `users`
--

LOCK TABLES `users` WRITE;
/*!40000 ALTER TABLE `users` DISABLE KEYS */;
INSERT INTO `users` VALUES (1,'admin','$2y$10$SxYdH4RDY0TkgjrnZyTnNOhQmCxSmyb/psjTklDAqym8gukpb.YCS','e9cca95339c72568824430a401d93882','admin@example.com','admin','administartor','-','0123456789',10,'2022-05-17 13:55:40','2022-05-17 15:25:52');
/*!40000 ALTER TABLE `users` ENABLE KEYS */;
UNLOCK TABLES;
/*!40103 SET TIME_ZONE=@OLD_TIME_ZONE */;

/*!40101 SET SQL_MODE=@OLD_SQL_MODE */;
/*!40014 SET FOREIGN_KEY_CHECKS=@OLD_FOREIGN_KEY_CHECKS */;
/*!40014 SET UNIQUE_CHECKS=@OLD_UNIQUE_CHECKS */;
/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
/*!40111 SET SQL_NOTES=@OLD_SQL_NOTES */;

-- Dump completed on 2022-05-17 15:31:02
